import img1 from "../assets/images/profile/77.png";
import img2 from "../assets/images/profile/5.jpg";
import img3 from "../assets/images/profile/1.jpg";
import img4 from "../assets/images/profile/12.jpg";
import w1 from "../assets/images/slider/1.jpg";
import w2 from "../assets/images/slider/7.webp";
import w3 from "../assets/images/slider/8.jpg";
import w4 from "../assets/images/slider/20.jpeg";
import w5 from "../assets/images/slider/21.jpg";
import w6 from "../assets/images/slider/22.jpg";
import f1 from "../assets/images/slider/2.jpg";
import f2 from "../assets/images/slider/9.jpg";
import f3 from "../assets/images/slider/30.jpg";
import f4 from "../assets/images/slider/31.jpeg";
import f5 from "../assets/images/slider/32.jpg";
import f6 from "../assets/images/slider/33.jpg";

export const artistsData = [
	{
		id: 1,
		name: "عبد الحليم على اسماعيل شبانه",
		img: img1,
		nickName: "العندليب الاسمر",
		birthDate: "21 يونيو 1929",
		deathData: "30 مارس 1977",
		deathReason: "تشمع الكبد",
		deathLocation: "البساتين",
		home: "جمهوريه مصر العربيه",
		school: "معهد الموسيقى العربيه",
		life: "ولد عبد الحليم علي إسماعيل شبانة في 21 يونيو 1929 في قرية الحلوات التابعة لمركز الإبراهيمية في محافظة الشرقية، وهو الابن الأصغر بين أربعة إخوة هم إسماعيل ومحمد وعليا. توفيت والدته بعد ولادته بأيام وقبل أن يتم عبد الحليم عامه الأول توفي والده ليعيش اليتم من جهة الأب كما عاشه من جهة الأم من قبل ليعيش بعدها في بيت خاله الحاج متولي عماشة. كان يلعب مع أولاد عمه في ترعة القرية، ومنها انتقل إليه مرض البلهارسيا الذي دمّر حياته. ولقد قال مرة أنا ابن القدر، حيث أجرى خلال حياته واحد وستين عملية جراحية.[9] كان حليم الابن الرابع وأكبر إخوته هو إسماعيل شبانة الذي كان مطرباً ومدرساً للموسيقى في وزارة التربية. التحق حليم، بعدما نضج قليلا في كتاب الشيخ أحمد؛ ومنذ دخول العندليب الأسمر للمدرسة تجلّى حبه العظيم للموسيقى حتى أصبح رئيسا لفرقة الأناشيد في مدرسته. ومن حينها وهو يحاول الدخول لمجال الغناء لشدة ولعه به.",
		englishName: "abdelhalim",
		works: [
			{
				id: 1,
				name: "صافينى مره",
				words: "سمير محجوب ",
				melody: "محمد الموجى",
				imgSrc: "",
			},
			{
				id: 2,
				name: "احنا كنا فين",
				words: "حسين السيد",
				melody: "منير مراد",
				imgSrc: "",
			},
			{
				id: 3,
				name: "على قد الشوق",
				words: "محمد على احمد",
				melody: "كمال الطويل",
				imgSrc: "",
			},
			{
				id: 4,
				name: "توبه",
				words: "حسين السيد",
				melody: "محمد عبد الوهاب",
				imgSrc: "",
			},
			{
				id: 5,
				name: "ياخلى القلب",
				words: "مرسى جميل عزيز",
				melody: "محمد عبد الوهاب",
				imgSrc: "",
			},
			{
				id: 6,
				name: "موعود",
				words: "محمد حمزه",
				melody: "بليغ حمدى",
				imgSrc: "",
			},
		],
	},
	{
		id: 2,
		name: "فريد فهد فرحان اسماعيل الاطرش",
		img: img2,
		nickName: "ملك العود",
		birthDate: "19 اكتوبر 1917",
		deathData: "26 ديسمبر 1974",
		deathReason: "مرض قلبى وعائى",
		deathLocation: "البساتين",
		home: "سوريا",
		school: "المدارس الفرنسيه",
		life: "ولد بعام 1917 في بلدة القريا في جبل الدروز. وقد عانى حرمان رؤية والده ومن اضطراره إلى التنقل والسفر منذ طفولته، من سوريا إلى القاهرة مع والدته هربًا من الفرنسيين المعتزمين اعتقاله وعائلته انتقاما لوطنية عائلة الأطرش في الجبل الذي قاتلوا ضد ظلم الفرنسيين في جبل الدروز بسوريا. وعاش فريد في القاهرة في حجرتين صغيرتين مع والدته عالية بنت المنذر وشقيقه فؤاد و أسمهان. التحق فريد بإحدى المدارس الفرنسية ((الخرنفش)) حيث اضطر إلى تغيير اسم عائلته فأصبحت كوسا بدلاً من الأطرش وهذا ما كان يضايقه كثيرا. ذات يوم زار المدرسة هنري هوواين فأعجب بغناء فريد وراح يشيد بعائلة الأطرش أمام أحد الأساتذة فطرد فريد من المدرسة. التحق بعدها بمدرسة البطريركية للروم الكاثوليك.",
		englishName: "farid",
		works: [
			{
				id: 1,
				name: "اول همسه",
				words: "مامون الشناوى",
				melody: "فريد الاطرش",
				imgSrc: f1,
			},
			{
				id: 2,
				name: "حكايه غرامى",
				words: "فتحى قوره",
				melody: "فريد الاطرش",
				imgSrc: f2,
			},
			{
				id: 3,
				name: "جميل جمال",
				words: "بيرم التونسى",
				melody: "فريد الاطرش",
				imgSrc: f3,
			},
			{
				id: 4,
				name: "يازهره فى خيالى",
				words: "مامون الشناوى",
				melody: "فريد الاطرش",
				imgSrc: f4,
			},
			{
				id: 5,
				name: "بساط الريح",
				words: "احمد رامى",
				melody: "فريد الاطرش",
				imgSrc: f5,
			},
			{
				id: 6,
				name: "احبك انت",
				words: "مامون الشناوى",
				melody: "فريد الاطرش",
				imgSrc: f6,
			},
		],
	},
	{
		id: 3,
		name: "محمد عبد الوهاب",
		nickName: "موسيقار الاجيال",
		birthDate: "13 مارس 1910",
		deathData: "3 مايو 1991",
		deathReason: "سكته دماغيه",
		deathLocation: "البساتين",
		home: "جمهوريه مصر العربيه",
		school: "معهد الموسيقى العربيه",
		life: "ولد محمد عبد الوهاب في 13 مارس 1898 في حي باب الشعرية بالقاهرة بعد انتقال أسرته من قريتهم بمحافظة الشرقية، وكان أبوه هو الشيخ محمد أبو عيسى المؤذن والقارئ في جامع سيدي الشعراني بباب الشعرية وأمه فاطمة حجازي التي أنجبت ثلاثة أولاد منهم محمد وبنتين",
		img: img4,
		englishName: "mohamed",
		works: [
			{
				id: 1,
				name: "ياجاره الوادى",
				words: "احمد شوقى",
				melody: "محمد عبد الوهاب",
				imgSrcr: "",
			},
			{
				id: 2,
				name: "خايف اقول اللى فى قلبى",
				words: "احمد عبد المجيد",
				melody: "محمد عبد الوهاب",
				imgSrc: "",
			},
			{
				id: 3,
				name: "كلنا نحب القمر",
				words: "احمد عبد المجيد",
				melody: "محمد عبد الوهاب",
				imgSrc: "",
			},
			{
				id: 4,
				name: "امتى الزمان يسمح ياجميل",
				words: "امين عزت الهجين",
				melody: "محمد عبدالوهاب",
				imgSrc: "",
			},
			{
				id: 5,
				name: "محلاها عيشه الفلاح",
				words: "بيرم التونسى",
				melody: "محمد  عبد الوهاب",
				imgSrc: "",
			},
			{
				id: 6,
				name: "6",
				words: "اللى انكتب على الجبين",
				melody: "ابراهيم عبد الوهاب",
				imgSrc: "",
			},
		],
	},
	{
		id: 4,
		name: "فاطمه ابراهيم السيد البلتاجى",
		birthDate: "31 ديسمبر 1898",
		nickName: "كوكب الشرق - سيده الغناء العربى",
		deathData: "3 فبراير 1975",
		deathReason: "فشل كلوى",
		deathLocation: "البساتين",
		home: "جمهوريه مصر العربيه",
		school: "معهد الموسيقى ",
		life: "ولدت فاطمة لأسرة متواضعة في قرية ريفية تسمى طماي الزهايرة، في مركز السنبلاوين محافظة الدقهلية، الخديوية المصرية، كان والدها الشيخ إبراهيم إماماً ومؤذناً لمسجد في القرية، ووالدتها فاطمة المليجي ربة منزل، ولها أخت متزوجة اسمها رقية وأخ اسمه خالد أكبر منها. تضاربت مصادر تاريخ ميلادها، ووفق مؤرخين فإن تاريخ ميلادها 31 ديسمبر 1898م، ولكن التاريخ المذكور في السجلات الرسمية 4 مايو 1908م. عاشت العائلة في مسكن صغير مُشيد من طوب طيني. وكان الدخل المادي للأسرة منخفضًا، والمصدر الرئيس للدخل هو والدها الذي يعمل مُنشدًا في حفلات الزواج للقرية، ومع ذلك لم يكن مجموع دخله من عمله الأساسي مؤذنًا وعمله الإضافي منشدًا يتجاوز عشرين قرشًا",
		img: img3,
		englishName: "omKolthom",
		works: [
			{
				id: 1,
				name: "الاطلال",
				words: "ابراهيم ناجى",
				melody: "رياض السنباطى",
				imgSrc: w1,
			},
			{
				id: 2,
				name: "انت عمرى",
				words: "احمد شفيق كامل",
				melody: "محمد عبد الوهاب",
				imgSrc: w2,
			},
			{
				id: 3,
				name: "امل حياتى",
				words: "احمد شفيق كامل",
				melody: "محمد عبد الوهاب",
				imgSrc: w3,
			},
			{
				id: 4,
				name: "فكرونى",
				words: "عبدالوهاب محمد",
				melody: "محمد عبدالوهاب",
				imgSrc: w4,
			},
			{
				id: 5,
				name: "سيره الحب",
				words: "مرسى جميل عزيز",
				melody: "بليغ حمدى",
				imgSrc: w5,
			},
			{
				id: 6,
				name: "انت الحب",
				words: "احمد رامى",
				melody: "رياض السنباطى",
				imgSrc: w6,
			},
		],
	},
];
