import img1 from "../assets/images/profile/2.jpeg";
import img2 from "../assets/images/profile/4.jpeg";
import img3 from "../assets/images/profile/12.jpg";
import img4 from "../assets/images/profile/10.jpg";

export const poineer = [
	{
		id: 1,
		name: "ام كلثوم",
		description:
			" سيده الغناء العربى كوكب الشرق ام كلثوم رمز لا يُضاهى في الأصالة والعبقرية الصوتية. بصوتها الذي يمزج بين القوة والعذوبة، غنّت القصائد والألحان التي تجاوزت الزمن، لتصبح أيقونة ثقافية تمثل وجدان الشعوب العربية في القرن العشرين. كانت تجمع بين ا لحضور الملكي على المسرح، والذكاء الفني في اختيار الكلمات والألحان.",
		age: "العصر الحديث",
		country: "مصر",
		date: "1975-1898",
		imgSrc: img1,
		englishName: "omKolthom",
		videoId: "AbU6Bg-6y5o",
	},
	{
		id: 2,
		name: "فريد الاطرش ",
		description:
			"ملك العود وواحد من أكثر الموسيقيين العرب تأثيرًا، جمع بين الموهبة التلحينية الفذة والصوت الشجي الحزين. تميز فنه بالمزج بين الموسيقى الشرقية والأنغام الغربية، ما منحه طابعًا فريدًا جعله محبوبًا من أجيال متعددة. كانت حياته الفنية انعكاسًا لعاطفته الصادقة وموسيقاه التي تنبض بالمشاعر.",
		age: "العصر الحديث",
		country: "سوريا",
		date: "1974-1917",
		imgSrc: img2,
		englishName: "farid",
		videoId: "nNltgC-HmYc",
	},
	{
		id: 3,
		name: "محمد عبد الوهاب   ",
		description:
			" موسيقار الاجيل وعبقري التلحين الذي أحدث ثورة موسيقية في العالم العربي. كان مجددًا لا يعرف الجمود، أدخل الآلات الغربية إلى التوزيع الموسيقي العربي وفتح آفاقًا جديدة للفن. صوته الهادئ المليء بالشجن، وألحانه الخالدة، جعلاه أحد أعمدة الموسيقى العربية الحديثة. ",
		age: "العصر الذهبى",
		country: "مصر ",
		date: "1991-1910",
		imgSrc: img3,
		englishName: "mohamed",
		videoId: "Uf7MNnski8E",
	},
	{
		id: 4,
		name: " عبد الحليم حافظ    ",
		description:
			"العندليب الاسمر  صوت الشباب والحنين، وصاحب المدرسة العاطفية الراقية. حمل هموم وأحلام جيله في أغانيه، وامتاز بأداءٍ درامي يُشعر المستمع أنه يعيش داخل الأغنية. رغم رحيله المبكر، ما زالت أغانيه تنبض بالحياة وتلامس القلوب.",
		age: "العصر الذهبى",
		country: "مصر ",
		date: "1977-1992",
		imgSrc: img4,
		englishName: "abdelhalim",
		videoId: "KgyzKTrQDs0",
	},
];
